## TITANIC SURVIVOR ANALYSIS

In [13]:
import pandas as pd
import numpy as np

READING DATA USING PANDAS

we use pandas read_csv function to read csv file. in python and pandas DataFrame method is used to convert file into dataframe.

In [ ]:
df = pd.DataFrame(pd.read_csv("/content/sample_data/train.csv"))
df.head(10)

TAIL METHOD

This method is used for Checking last elemnets of the DataFrame with tail() method.

In [15]:
df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

DESCRIBE METHOD

This method is used to get a summary of numeric value in our dataset.

In [16]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

INFO METHOD

This method is used to print information about dataframe including non null value.

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

we can also see the datatype of columns with .dtypes

In [18]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

SORTING NUMERIC DATA

it is used for arranging dataset into ascending or descending order.

In [19]:
df.sort_values("Fare")

     PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
271          272         1       3  ...    0.0000          NaN         S
597          598         0       3  ...    0.0000          NaN         S
302          303         0       3  ...    0.0000          NaN         S
633          634         0       1  ...    0.0000          NaN         S
277          278         0       2  ...    0.0000          NaN         S
..           ...       ...     ...  ...       ...          ...       ...
438          439         0       1  ...  263.0000  C23 C25 C27         S
341          342         1       1  ...  263.0000  C23 C25 C27         S
737          738         1       1  ...  512.3292         B101         C
258          259         1       1  ...  512.3292          NaN         C
679          680         1       1  ...  512.3292  B51 B53 B55         C

[891 rows x 12 columns]

NUNIQUE METHOD

In [ ]:
it is used for see the number of unique records in a dataset.

In [20]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

we can also count the uniquwe records with .nunique() for column.

In [21]:
df["Embarked"].nunique()

3

FILTERING

Filtering under one Condition.

In [23]:
df[df["Embarked"] == "C"]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
9             10         1       2  ...  30.0708   NaN         C
19            20         1       3  ...   7.2250   NaN         C
26            27         0       3  ...   7.2250   NaN         C
30            31         0       1  ...  27.7208   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
866          867         1       2  ...  13.8583   NaN         C
874          875         1       2  ...  24.0000   NaN         C
875          876         1       3  ...   7.2250   NaN         C
879          880         1       1  ...  83.1583   C50         C
889          890         1       1  ...  30.0000  C148         C

[168 rows x 12 columns]

NULL VALUE

isnull() method we can get boolean series, by making the condition we can extract the valueswhich are null.

In [24]:
null_mask=df["Cabin"].isnull()
df[null_mask]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
2              3         1       3  ...   7.9250   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[687 rows x 12 columns]

In [25]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.036847 -0.077221 -0.369226  ... -0.308247 -0.189119  0.096067
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

sibsp: Number of Siblings
parch: Number of Parents
so we can make new column family_size by combining these two.

In [29]:
df['family_size'] = df['SibSp']*df['Parch']
df.drop(['SibSp','Parch'], axis=1, inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  family_size
PassengerId     1.000000 -0.005007 -0.035144  0.036847  0.012658    -0.024915
Survived       -0.005007  1.000000 -0.338481 -0.077221  0.257307    -0.077257
Pclass         -0.035144 -0.338481  1.000000 -0.369226 -0.549500     0.125494
Age             0.036847 -0.077221 -0.369226  1.000000  0.096067    -0.296075
Fare            0.012658  0.257307 -0.549500  0.096067  1.000000     0.148475
family_size    -0.024915 -0.077257  0.125494 -0.296075  0.148475     1.000000

**Familysize in the ship does not have much correlance with survival rate.**

Lets check if we weather the person was alone or not can affect the survival rate.

In [30]:
df['Alone'] = [0 if df['family_size'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked family_size  Alone
0            1         0       3  ...        S           0      1
1            2         1       1  ...        C           0      1
2            3         1       3  ...        S           0      1
3            4         1       1  ...        S           0      1
4            5         0       3  ...        S           0      1

[5 rows x 12 columns]

In [31]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.436620
1    0.373832
Name: Survived, dtype: float64

if the person is alone he/she has less chance of survivng

the reason might be the person who istravelling with his family might be belonging to rich class and might be prioritized over other.

In [32]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.158033
Fare  -0.158033  1.000000

it show women are prioritized over man.

In [33]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

### CONCLUSION

*  Female passengers were prioritized over men.
*  people with high class or rich people have high survival rate than the others.
*  Passengers travelling with their family have higher survival rate.